Tutorials/lofiAirfoilNoise/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          99;
        startFace       36927;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          37026;
        startFace       37026;
    }
    inlet
    {
        type            patch;
        nFaces          51;
        startFace       74052;
    }
    outlet
    {
        type            patch;
        nFaces          48;
        startFace       74103;
    }
)

// ************************************************************************* //
