Tutorials/lofiAirfoilNoise/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    // limited         cellLimited Gauss linear 1;
    // grad(U)         $limited;
    // grad(k)         $limited;
    // grad(omega)     $limited;
}

defaultAdvScheme                                    vanLeer;
defaultAdvSchemeV                                   vanLeer;

divSchemes
{
    default                                         none;
    div(meshPhi,p)                                  Gauss vanLeer;
    div((meshPhi*interpolate(thermo:psi)),pcorr)    Gauss vanLeer;
    div((phi|interpolate(rho)),p)                   Gauss linear;

    //momentum equation
    div(phi,U)                                      Gauss $defaultAdvSchemeV;
    div(((rho*nuEff)*dev2(T(grad(U)))))             Gauss linear;

    //energy equation
    div(phi,h)                                      Gauss $defaultAdvScheme;
    div(phi,K)                                      Gauss $defaultAdvScheme;

    div(((rho*U)*U))                                Gauss linear; //FWH analogy

    //continuity equation
    div(phid,p)                                     Gauss $defaultAdvScheme;

    div(phi,U)                                      Gauss LUST grad(U);

    turbulence                                      Gauss upwind;
    energy                                          Gauss upwind;

    div(phi,k)                                      $turbulence;
    div(phi,epsilon)                                $turbulence;
    div(phi,omega)                                  $turbulence;

    div(phi,e)                                      Gauss LUST grad(e);
    // div(phi,Ekp)                                    $energy;

    div(phiv,p)                                     Gauss linear;
}

interpolationSchemes
{
    default                                         linear;

    reconstruct(rho)                                $defaultAdvScheme;
    reconstruct(psi)                                $defaultAdvScheme;
    reconstruct(p)                                  $defaultAdvScheme;
    reconstruct(U)                                  $defaultAdvSchemeV;
    reconstruct(rho*U)                              $defaultAdvSchemeV;
    reconstruct(Dp)                                 $defaultAdvScheme;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
