Tutorials/lofiAirfoilNoise/system/soundPressureSampling
surfacePressure
{
    type                        soundPressureSampler;
    libs                        ("libAcoustics.so");
    writeControl                timeStep;
    writeInterval               1;

    outputGeometryFormat        gmsh;

    fields
    (
                                p
    );

    pName                       p;

    log                         true;

    interpolationScheme         cellPoint;

    surfaces
    (
        triSurfaceSamplingCoarse
        {

            type                sampledTriSurfaceMesh;
            surface             sphere_426.stl;
            source              cells;  // What to sample: cells (nearest cell)
                                        // insideCells (only triangles inside cell)
                                        // boundaryFaces (nearest boundary face)
            interpolate         true;
        }

        triSurfaceSamplingFine
        {

            type                sampledTriSurfaceMesh;
            surface             sphere_1808.stl;
            source              cells;  // What to sample: cells (nearest cell)
                                        // insideCells (only triangles inside cell)
                                        // boundaryFaces (nearest boundary face)
            interpolate         true;
        }
    );
}
